app/controllers/users_controller.rb

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('Michael Hartl', '1fba1ea343547e64e44e187faa87ad7d5784a9f05add733f6fdcb4ad0063513b', 'f0d59bfffd44cd936cb5d78af2ee4bc1e6d8b9288e6d389886236a8be7aa3b41', '2010-08-16 12:01:50', '2010-08-16 12:01:50', NULL, 'mhartl@example.com')
---
  def create
    @user=User.new(params[:user])
    if @user.save